[
    {
      "id": 1,
      "courseName": "Mathematics 6",
      "courseCode": "MATH-6",
      "description": "Comprehensive course covering basic arithmetic, fractions, decimals, and introduction to geometry.",
      "detailedDescription": "This course provides a solid foundation in arithmetic, including the use of fractions and decimals, while introducing basic geometric concepts.",
      "feeStructure": "$500",
      "grade": 6
    },
    {
      "id": 2,
      "courseName": "Mathematics 7",
      "courseCode": "MATH-7",
      "description": "Advanced course building on Mathematics 6, focusing on integers, ratios, proportions, and basic algebra concepts.",
      "detailedDescription": "Students will explore integers, ratios, and proportions, and begin their journey into basic algebraic concepts and operations.",
      "feeStructure": "$500",
      "grade": 7
    },
    {
      "id": 3,
      "courseName": "Pre-Algebra GT",
      "courseCode": "PRE-ALG-GT",
      "description": "A gifted and talented course that prepares students for high school algebra with a focus on advanced topics in mathematics.",
      "detailedDescription": "This course provides students with a deeper understanding of algebraic concepts and prepares them for future advanced math courses.",
      "feeStructure": "$600",
      "grade": 7
    },
    {
      "id": 4,
      "courseName": "Mathematics 8",
      "courseCode": "MATH-8",
      "description": "Exploration of functions, geometry, and statistics.",
      "detailedDescription": "This course focuses on the study of functions and their applications, along with an introduction to geometric principles and basic statistics.",
      "feeStructure": "$600",
      "grade": 8
    },
    {
      "id": 5,
      "courseName": "Algebra I",
      "courseCode": "ALG-I",
      "description": "Introduction to algebra, focusing on solving equations and graphing linear functions.",
      "detailedDescription": "Students will learn the foundational concepts of algebra, including solving equations and graphing linear functions on a coordinate plane.",
      "feeStructure": "$700",
      "grade": 9
    },
    {
      "id": 6,
      "courseName": "Geometry G",
      "courseCode": "GEOM-G",
      "description": "Study of shapes, sizes, and properties of space, with a focus on geometric principles and proofs.",
      "detailedDescription": "This course covers essential geometric concepts, including the properties of shapes, theorems, and proofs.",
      "feeStructure": "$700",
      "grade": 9
    }
  ]
  