[
  {
    "id": 1,
    "title": "Introduction to Computer Science",
    "description": "An introductory course to computer science, covering basic programming concepts and algorithms.",
    "image": "./courseImages/iot.jpg",
    "detailedDescription": "This course provides an introduction to the field of computer science. Students will learn about basic programming concepts, algorithms, and data structures. The course also covers the history of computing and the impact of technology on society.",
    "feeStructure": "$500"
  },
  {
    "id": 2,
    "title": "Data Structures and Algorithms",
    "description": "A comprehensive course on data structures and algorithms, essential for efficient programming.",
    "image": "/static/images/courses/data-structures.jpg",
    "detailedDescription": "This course covers fundamental data structures and algorithms used in computer science. Topics include arrays, linked lists, stacks, queues, trees, graphs, sorting algorithms, and searching algorithms. Students will learn how to implement these data structures and algorithms in various programming languages.",
    "feeStructure": "$600"
  },
  {
    "id": 3,
    "title": "Web Development",
    "description": "Learn how to build modern web applications using HTML, CSS, and JavaScript.",
    "image": "./courseImages/web.jpg",
    "detailedDescription": "This course teaches students how to build modern web applications using HTML, CSS, and JavaScript. Topics include responsive design, front-end frameworks, and back-end development with Node.js. Students will also learn about web security and best practices for web development.",
    "feeStructure": "$700"
  },
  {
    "id": 4,
    "title": "Machine Learning",
    "description": "An in-depth course on machine learning techniques and applications.",
    "image": "/static/images/courses/machine-learning.jpg",
    "detailedDescription": "This course provides an in-depth look at machine learning techniques and applications. Topics include supervised and unsupervised learning, neural networks, deep learning, and reinforcement learning. Students will learn how to implement machine learning algorithms using popular libraries such as TensorFlow and scikit-learn.",
    "feeStructure": "$800"
  },
  {
    "id": 5,
    "title": "Database Management Systems",
    "description": "Learn about database design, SQL, and database management systems.",
    "image": "/static/images/courses/database-management.jpg",
    "detailedDescription": "This course covers the principles of database design and management. Topics include relational databases, SQL, normalization, indexing, and transactions. Students will learn how to design and implement databases using popular database management systems such as MySQL and PostgreSQL.",
    "feeStructure": "$550"
  },
  {
    "id": 6,
    "title": "Cybersecurity",
    "description": "A comprehensive course on cybersecurity principles and practices.",
    "image": "/static/images/courses/cybersecurity.jpg",
    "detailedDescription": "This course provides a comprehensive overview of cybersecurity principles and practices. Topics include network security, cryptography, risk management, and incident response. Students will learn how to protect systems and data from cyber threats and how to respond to security incidents.",
    "feeStructure": "$750"
  },
  {
    "id": 7,
    "title": "Artificial Intelligence",
    "description": "Explore the fundamentals of artificial intelligence and its applications.",
    "image": "/static/images/courses/artificial-intelligence.jpg",
    "detailedDescription": "This course explores the fundamentals of artificial intelligence and its applications. Topics include search algorithms, knowledge representation, natural language processing, and robotics. Students will learn how to develop AI applications using popular AI frameworks and tools.",
    "feeStructure": "$850"
  },
  {
    "id": 8,
    "title": "Software Engineering",
    "description": "Learn about software development methodologies and best practices.",
    "image": "/static/images/courses/software-engineering.jpg",
    "detailedDescription": "This course covers software development methodologies and best practices. Topics include software development life cycle, agile methodologies, version control, and software testing. Students will learn how to manage software projects and develop high-quality software products.",
    "feeStructure": "$650"
  },
  {
    "id": 9,
    "title": "Cloud Computing",
    "description": "An introduction to cloud computing and its services.",
    "image": "/static/images/courses/cloud-computing.jpg",
    "detailedDescription": "This course provides an introduction to cloud computing and its services. Topics include cloud architecture, virtualization, cloud storage, and cloud security. Students will learn how to deploy and manage applications on cloud platforms such as AWS, Azure, and Google Cloud.",
    "feeStructure": "$700"
  },
  {
    "id": 10,
    "title": "Mobile App Development",
    "description": "Learn how to develop mobile applications for Android and iOS.",
    "image": "/static/images/courses/mobile-app-development.jpg",
    "detailedDescription": "This course teaches students how to develop mobile applications for Android and iOS. Topics include mobile UI/UX design, mobile frameworks, and mobile app deployment. Students will learn how to build and publish mobile apps using tools such as Android Studio and Xcode.",
    "feeStructure": "$750"
  }
]